[ 
  {
    "status" : 1,
    "running" : 1,
    "title": "Advanced Training for Olympiad Mathematics",
    "brand_image" : "/assets/img/math2.jpg",
    "short_description": "A 12-week course on more advanced topics in olympiad mathematics to prepare students for BdMO National Camps and Team Selection Tests",
    "long_description": "<p><b>Advanced Training for Olympiad Mathematics</b> is a Bangladesh National Camp level course. Familiarity with all the basic topics and theories is required to benefit the most from this course. A student should expect to spend at least 10 hours per week behind the problem sets.</p> <p>This course is structured in a weekly basis spanning over twelve weeks. Each week will center around a certain topic or a certain group of problems that regularly appear on math olympiads. There will be two classes every week: one Theory class, and one Discussion class. Handouts will be delivered to the students after the theory class. The students are expected to try the problems before attending the discussion class, where the problems will be discussed in details.</p> <p>One can choose not to register for the classes but receive the weekly handouts. In that option, the cost of the course would be half of the original.</p> <p><a href=https://drive.google.com/file/d/1xEgVb41-MDIoz-MZQ9_V9BnNJvMkJI1m/view?usp=sharing> Sample Algorithms Problem Set</a></p>",
    "pre_requirements": [
      "Good grasp on problem solving",
      "Familiarity with all basic topics"
    ],
    "course_content": [
      "<b>Week 1</b> <i>Induction and other strategies</i> <p>Using the induction, contradiction, extremal and pigeonhole principal to solve combinatorial problems. This week's focus is to set the necessary foundation for the later topics of this course.</p>",
      "<b>Week 2</b> <i>Triangle Centers</i> <p>Explore the configurations of important triangle centers like orthocenter, circumcenter, nine-point center, incenter-excenters and mixtilinear centers.</p>",
      "<b>Week 3</b> <i>Primes and Orders</i> <p>Modular arithmetic modulo primes. Orders modulo prime. Lifting the exponent lemma.  Prime factorization.</p>",
      "<b>Week 4</b> <i>Graph Theory</i> <p>Basic introduction to graph theory. Using extremal principal and induction in graphs. Graph algorithms and bounding.</p>",
      "<b>Week 5</b> <i>Projective Geometry</i> <p>Basic concepts of cross ratio, harmonic bundle, inversion. Symmedians and projective transformation. Pascal, Brianchon and Puppus' Theorem.</p>",
      "<b>Week 6</b> <i>NT Functions and Constructions</i> <p>Number theoretic functions and integer polynomials, polynomial divisibility.  Ad-Hoc number theory construction problems using primes, divisors and modular arithmetic.</p>",
      "<b>Week 7</b> <i>Algorithms</i> <p>Divide and conquer, greedy algorithms. Other graph algorithms and configuration building strategies.</p>",
      "<b>Week 8</b> <i>Polynomials</i> <p>Basic concepts of polynomials. Polynomial root finding, polynomial equations, and integer polynomials.</p>",
      "<b>Week 9</b> <i>Sequences and Recursion</i> <p>Techniques of solving sequence and recursion related problems.</p>",
      "<b>Week 10</b> <i>Complete Quadrilaterals and Circles</i> <p>Explore the configurations of cyclic quadrilateral and complete quadrilaterals in general. Spiral similarity and pole-polar transformation.</p>",
      "<b>Week 11</b> <i>Coloring and Invariance</i> <p>Using the properties of invariants and monovariants in miscellaneous problems, including grid coloring and algorithmic analysis.</p>",
      "<b>Week 12</b> <i>Combinatorial Games and Geometry</i> <p>Basic introduction to combinatorial games. Copying strategies, impartial games.  Basic concepts in combinatorial geometry.</p>",
      "<b>Week 13</b> <i>Projective Geometry 2</i> <p>Continuation of the projective geometry class. Pole polars and projective transformations.</p>",
      "<b>Week 14</b> <i>Ad Hoc Algebra</i> <p>Combinatorial tricks in algebra problems, basically the weird problems that aren't functional equations, polynomials or inequalities, and many different ways of solving them.</p>",
      "<b>Week 15</b> <i>Grids and Graphs</i> <p>Problems related to grids, and the grid to graph transformation and vice versa</p>",
      "<b>Week 16</b> <i>Functional Equations</i> <p>Basic techniques in solving functional equations and other functions related problems.</p>"
    ],
    "course_price": "1500 weekly, for full course; 750 weekly for only the handouts",
    "this_course_includes": [
      "One weekly theory lecture",
      "One weekly discussion session",
      "Weekly problem set"
    ],
    "schedule" : [
      ["Theory Class", "Sunday", "12:00pm - 2:00pm"],
      ["Discussion Class", "Thursday", "12:00pm - 2:00pm"],
      ["Weekly problem set submission", "Wednesday", "11:59pm"]
    ],
    "payment" : "<p>At the time of registration, you need to make and confirm the payment. You can register for as many or as few courses as you wish. The fee is 1500 BDT per week. So for each month, the fee is 6000 BDT.</p> <p>The payment should be made via BKash to the number <b>01928987074</b>. Take note of the BKash number from which the payment was made with and the transaction id, as you will require them to fill up the registration form.</p> <p>There are also scholarships available to campers. If you want to apply for a scholarship, please contact me personally.</p>",
    "subscribe_link" : "https://forms.gle/Kv8pPx3E5UeLvJWd6",
    "permalink": "/course/atom"
  },
  {
    "status" : 1,
    "running" : 1,
    "title": "Advanced Training for Olympiad Mathematics for Beginners",
    "brand_image" : "/assets/img/math2.jpg",
    "short_description": "A 9-week course to prepare students for the Bangladesh National Mathematical Olympiad, in collaboration with Tahmid Hameem Chowdhury Zarif.",
    "long_description" : "A 9-week course to prepare students for the Bangladesh National Mathematical Olympiad, in collaboration with Tahmid Hameem Chowdhury Zarif. We will cover the basic theories for the Junior and Secondary catagories. This course is designed for beginners who have participated and performed well in Regional olympiads before. The course will be challenging, and the students will require to spend about 10 hours a week to cope up with the materials.",
    "pre_requirements": [
      "Familiarity with olympiad style problems",
      "Have regional level problem solving abilities"
    ],
    "course_content": [
      "Coming Soon"
    ],
    "course_price": "6000 per month",
    "this_course_includes": [
      "One weekly theory lecture",
      "One weekly discussion session",
      "Weekly problem set"
    ],
    "schedule" : "Coming Soon",
    "payment" : "Coming Soon",
    "subscribe_link" : "https://duoblogger.github.io",
    "permalink": "/course/atom_beginner"
  },
  {
    "status" : 1,
    "running" : 0,
    "title": "BdMO Crash Course",
    "brand_image" : "/assets/img/math2.jpg",
    "short_description": "A 9-week crash course to prepare students for the National Mathematical Olympiad, in collaboration with Ahmed Ittihad Hasib, current undergraduate in Oxford University.",
    "long_description" : "A 9-week crash course to prepare students for the National Mathematical Olympiad, in collaboration with Ahmed Ittihad Hasib, current undergraduate in Oxford University.",
    "pre_requirements": [
      "Familiarity with olympiad style problems",
      "Have regional level problem solving abilities"
    ],
    "course_content": [
      "<a href=https://drive.google.com/drive/folders/1nfhIhKlJOB6c9YT_ZFIpOHMnAziirOJI?usp=sharing><b>Junior Handouts Link</b></a>",
      "<b>Week 1</b> Junior: Basic Counting Strategies", 
      "<b>Week 2</b> Junior: Number Theory - Divisibility", 
      "<b>Week 3</b> Junior: Geometry Essentials", 
      "<b>Week 4</b> Junior: Number Theory Continued", 
      "<b>Week 5</b> Junior: Geometry Continued", 
      "<b>Week 6</b> Junior: Symmetry and Invariance", 
      "<b>Week 7</b> Junior: Induction", 
      "<b>Week 8</b> Junior: Algebra and Logic Puzzles", 
      "<b>Week 9</b> Junior: Miscellaneous Problems Collection", 

      "<a href=https://drive.google.com/drive/folders/1Zganaxak91Gj1W9XKm4f4Lt0xlP61CIc?usp=sharing><b>Secondary Handouts Link</b></a>",
      "<b>Week 1</b> Secondary: Basic Counting Strategies",
      "<b>Week 2</b> Secondary: Induction",
      "<b>Week 3</b> Secondary: Angle Chasing",
      "<b>Week 4</b> Secondary: Length Chasing",
      "<b>Week 5</b> Secondary: Number Theory - Divisibility",
      "<b>Week 6</b> Secondary: Regional Preparation Test, Graph Theory",
      "<b>Week 7</b> Secondary: Miscellaneous Algebra",
      "<b>Week 8</b> Secondary: Modular Arithmetic",
      "<b>Week 9</b> Secondary: Random Topics"
    ],
    "course_price": "6000 per month",
    "this_course_includes": [
      "One weekly theory lecture",
      "One weekly discussion session",
      "Weekly problem set"
    ],
    "schedule" : "None",
    "payment" : "None",
    "subscribe_link" : "https://duoblogger.github.io",
    "permalink": "/course/crash_course"
  }
]  
